In [2]:
import numpy as np
import pandas as pd

In [3]:
print(pd.__version__)

1.5.3

In [4]:
A = pd.Series([2,3,4,5],index=['a','b','c','d'])

In [5]:
A

a    2
b    3
c    4
d    5
dtype: int64

In [6]:
type(A.values)

numpy.ndarray

In [7]:
type(A)

pandas.core.series.Series

In [8]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
type(A.index)

pandas.core.indexes.base.Index

In [10]:
A['a']

2

In [11]:
A['a':'c'] # final index included

a    2
b    3
c    4
dtype: int64

In [12]:
grades_dict = {'A':4,'B':3.5,'C':3,'D':2.5}
grades = pd.Series(grades_dict)

In [13]:
grades.values

array([4. , 3.5, 3. , 2.5])

In [14]:
marks_dict = {'A':85,'B':75,'C':65,'D':55}
marks = pd.Series(marks_dict)

In [15]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [16]:
marks[0:2] # implicit indices, but can be dangerous if explicit are numerics

A    85
B    75
dtype: int64

In [17]:
D = pd.DataFrame({'Grades':grades,'Marks':marks})

In [18]:
D

   Grades  Marks
A     4.0     85
B     3.5     75
C     3.0     65
D     2.5     55

In [19]:
D.T

           A     B     C     D
Grades   4.0   3.5   3.0   2.5
Marks   85.0  75.0  65.0  55.0

In [20]:
D.values

array([[ 4. , 85. ],
       [ 3.5, 75. ],
       [ 3. , 65. ],
       [ 2.5, 55. ]])

In [21]:
D.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
D.values[2,0]

3.0

In [23]:
D.columns

Index(['Grades', 'Marks'], dtype='object')

In [24]:
D['ScaledMarks'] = D['Marks']/85*90

In [25]:
D

   Grades  Marks  ScaledMarks
A     4.0     85    90.000000
B     3.5     75    79.411765
C     3.0     65    68.823529
D     2.5     55    58.235294

In [26]:
del D['ScaledMarks']

In [27]:
D

   Grades  Marks
A     4.0     85
B     3.5     75
C     3.0     65
D     2.5     55

In [28]:
G = D[D['Marks']>70]

In [29]:
G

   Grades  Marks
A     4.0     85
B     3.5     75

In [30]:
pd.DataFrame([{'a':1,'b':2},{'b':3,'c':4}]) # another way to create a dataframe

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [31]:
A = pd.DataFrame({'a':1,'b':4},{'b':-3,'c':9}) # notice that this is not as you would like!

In [32]:
A = pd.DataFrame([{'a':1,'b':4},{'b':-3,'c':9}])

In [33]:
A

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [34]:
A.fillna(0) # fill NaA values

     a  b    c
0  1.0  4  0.0
1  0.0 -3  9.0

In [43]:
A.dropna() # another way to handle NaN values.

Empty DataFrame
Columns: [a, b, c]
Index: []

In [40]:
A

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [41]:
# Pandas Indexing with numbers: explicit VS implicit

In [47]:
A = pd.Series(['a','b','c'], index = [1,3,5])

In [48]:
A[1] # ok, Explicit index

'a'

In [51]:
A[1:3] # here we are using an IMPLICIT index for slicing operator! not what expected!

3    b
5    c
dtype: object

In [52]:
A.loc[1:3] # use explicit indices for slicing

1    a
3    b
dtype: object

In [53]:
B = pd.Series(['a','b','c'], index=[1,5,3]) # My curiosity

In [54]:
B.loc[1:3] # so it has an order, the one of the list. Ok.

1    a
5    b
3    c
dtype: object

In [55]:
A.iloc[1:3] # I am specifying to use implicit indices. Here indexing is the same of Numpy

3    b
5    c
dtype: object

In [56]:
D

   Grades  Marks
A     4.0     85
B     3.5     75
C     3.0     65
D     2.5     55

In [58]:
D.iloc[2,:] # works also for dataframes, as for numpy

Grades     3.0
Marks     65.0
Name: C, dtype: float64

In [59]:
D.iloc[::-1,:]

   Grades  Marks
D     2.5     55
C     3.0     65
B     3.5     75
A     4.0     85